ARMmbed/mbed-hal-st-stm32f4/source/i2c_api.c
/* mbed Microcontroller Library
 *******************************************************************************
 * Copyright (c) 2014, STMicroelectronics
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of STMicroelectronics nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *******************************************************************************
 */
#include "mbed-drivers/mbed_assert.h"
#include "i2c_api.h" 

#if DEVICE_I2C

#ifndef USE_STM32F4XX_HAL_I2C__FIX
#error Please use stm32f4xx_hal_i2c__FIX.c
#endif

#include "cmsis.h"
#include "pinmap.h"
#include "PeripheralPins.h"

/* Timeout values for flags and events waiting loops. These timeouts are
   not based on accurate values, they just guarantee that the application will
   not remain stuck if the I2C communication is corrupted. */
#define FLAG_TIMEOUT ((int)0x1000)
#define LONG_TIMEOUT ((int)0x8000)


int i2c1_inited = 0;
int i2c2_inited = 0;
int i2c3_inited = 0;

#if defined(I2C3_BASE)
  #define MODULES_SIZE_I2C 3
  #if DEVICE_I2C_ASYNCH
static const IRQn_Type I2cEventIRQs[MODULES_SIZE_I2C] = {  
    I2C1_EV_IRQn,  
    I2C2_EV_IRQn, 
    I2C3_EV_IRQn,  
};  
static const IRQn_Type I2cErrorIRQs[MODULES_SIZE_I2C] = {  
    I2C1_ER_IRQn,  
    I2C2_ER_IRQn,  
    I2C3_ER_IRQn,
};
  #endif
#elif defined(I2C2_BASE)
  #define MODULES_SIZE_I2C 2
  #if DEVICE_I2C_ASYNCH
static const IRQn_Type I2cEventIRQs[MODULES_SIZE_I2C] = {  
    I2C1_EV_IRQn,  
    I2C2_EV_IRQn,  
};  
static const IRQn_Type I2cErrorIRQs[MODULES_SIZE_I2C] = {  
    I2C1_ER_IRQn,  
    I2C2_ER_IRQn,  
};
  #endif
#else
  #define MODULES_SIZE_I2C 1
  #if DEVICE_I2C_ASYNCH
static const IRQn_Type I2cEventIRQs[MODULES_SIZE_I2C] = {  
    I2C1_EV_IRQn,  
};  
static const IRQn_Type I2cErrorIRQs[MODULES_SIZE_I2C] = {  
    I2C1_ER_IRQn,  
};
  #endif
#endif

I2C_HandleTypeDef t_I2cHandle[MODULES_SIZE_I2C];

#if !DEVICE_I2C_ASYNCH
int i2c_module_lookup(i2c_t *obj)
{
	switch(obj->i2c)
	{
		case I2C_1: return 0;
#if defined(I2C2_Base)
		case I2C_2: return 1;
#endif
#if defined(I2C3_Base)
		case I2C_3: return 2;
#endif	    
		default: return 0;
	}
}
#else //DEVICE_I2C_ASYNCH
int i2c_module_lookup(i2c_t *obj)
{
	switch(obj->i2c.i2c)
	{
		case I2C_1: return 0;
#if defined(I2C2_Base)
		case I2C_2: return 1;
#endif
#if defined(I2C3_Base)
		case I2C_3: return 2;
#endif	    
		default: return 0;
	}
}

int i2c_module_lookup_handler(I2C_HandleTypeDef* hi2c)
{
  uint32_t I2C_address = (uint32_t)&(hi2c->Instance);
  
	switch(I2C_address)
	{
		case I2C_1: return 0;
#if defined(I2C2_BASE)
		case I2C_2: return 1;
#endif
#if defined(I2C3_BASE)
		case I2C_3: return 2;
#endif		
		default: return 0;
	}
}
#endif

void i2c_init(i2c_t *obj, PinName sda, PinName scl)
{
    // Determine the I2C to use
    I2CName i2c_sda = (I2CName)pinmap_peripheral(sda, PinMap_I2C_SDA);
    I2CName i2c_scl = (I2CName)pinmap_peripheral(scl, PinMap_I2C_SCL);

#if !DEVICE_I2C_ASYNCH
    obj->i2c = (I2CName)pinmap_merge(i2c_sda, i2c_scl);
    MBED_ASSERT(obj->i2c != (I2CName)NC);
#else
    obj->i2c.i2c = (I2CName)pinmap_merge(i2c_sda, i2c_scl);
    MBED_ASSERT(obj->i2c.i2c != (I2CName)NC);
#endif

    // Enable I2C1 clock and pinout if not done
#if !DEVICE_I2C_ASYNCH	
    if ((obj->i2c == I2C_1) && !i2c1_inited) {
#else
    if ((obj->i2c.i2c == I2C_1) && !i2c1_inited) {
#endif
        i2c1_inited = 1;
        __I2C1_CLK_ENABLE();
        // Configure I2C pins
        pinmap_pinout(sda, PinMap_I2C_SDA);
        pinmap_pinout(scl, PinMap_I2C_SCL);
        pin_mode(sda, OpenDrain);
        pin_mode(scl, OpenDrain);
    }
    // Enable I2C2 clock and pinout if not done
#if !DEVICE_I2C_ASYNCH	
    if ((obj->i2c == I2C_2) && !i2c2_inited) {
#else
    if ((obj->i2c.i2c == I2C_2) && !i2c2_inited) {
#endif
        i2c2_inited = 1;
        __I2C2_CLK_ENABLE();
        // Configure I2C pins
        pinmap_pinout(sda, PinMap_I2C_SDA);
        pinmap_pinout(scl, PinMap_I2C_SCL);
        pin_mode(sda, OpenDrain);
        pin_mode(scl, OpenDrain);
    }
    // Enable I2C3 clock and pinout if not done
#if !DEVICE_I2C_ASYNCH	
    if ((obj->i2c == I2C_3) && !i2c3_inited) {
#else
    if ((obj->i2c.i2c == I2C_3) && !i2c3_inited) {
#endif
        i2c3_inited = 1;
        __I2C3_CLK_ENABLE();
        // Configure I2C pins
        pinmap_pinout(sda, PinMap_I2C_SDA);
        pinmap_pinout(scl, PinMap_I2C_SCL);
        pin_mode(sda, OpenDrain);
        pin_mode(scl, OpenDrain);
    }

    // Reset to clear pending flags if any
    i2c_reset(obj);

    // I2C configuration
    i2c_frequency(obj, 100000); // 100 kHz per default

    // I2C master by default
#if !DEVICE_I2C_ASYNCH    
    obj->slave = 0;
#else
    obj->i2c.slave = 0;    
#endif    
}

void i2c_frequency(i2c_t *obj, int hz)
{
    MBED_ASSERT((hz > 0) && (hz <= 400000));
#if !DEVICE_I2C_ASYNCH
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c);
#else
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c.i2c);
#endif
  
