ARMmbed/mbed-hal-st-stm32f4/source/i2c_api.c
    int timeout;

    // wait before init
    timeout = LONG_TIMEOUT;
    while ((__HAL_I2C_GET_FLAG(&t_I2cHandle[i2c_module_lookup(obj)], I2C_FLAG_BUSY)) && (timeout-- != 0));

    // I2C configuration
    t_I2cHandle[i2c_module_lookup(obj)].Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT;
    t_I2cHandle[i2c_module_lookup(obj)].Init.ClockSpeed      = hz;
    t_I2cHandle[i2c_module_lookup(obj)].Init.DualAddressMode = I2C_DUALADDRESS_DISABLED;
    t_I2cHandle[i2c_module_lookup(obj)].Init.DutyCycle       = I2C_DUTYCYCLE_2;
    t_I2cHandle[i2c_module_lookup(obj)].Init.GeneralCallMode = I2C_GENERALCALL_DISABLED;
    t_I2cHandle[i2c_module_lookup(obj)].Init.NoStretchMode   = I2C_NOSTRETCH_DISABLED;
    t_I2cHandle[i2c_module_lookup(obj)].Init.OwnAddress1     = 0;
    t_I2cHandle[i2c_module_lookup(obj)].Init.OwnAddress2     = 0;
    HAL_I2C_Init(&t_I2cHandle[i2c_module_lookup(obj)]);
#if !DEVICE_I2C_ASYNCH    
    if (obj->slave) {
#else      
    if (obj->i2c.slave) {
#endif      
        /* Enable Address Acknowledge */
        t_I2cHandle[i2c_module_lookup(obj)].Instance->CR1 |= I2C_CR1_ACK;
    }

#if DEVICE_I2C_ASYNCH_DMA
  static DMA_HandleTypeDef hdma_tx;
  static DMA_HandleTypeDef hdma_rx;
  t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c.i2c);

  if(t_I2cHandle[i2c_module_lookup(obj)].Instance == I2C2) {
    hdma_tx.Instance                 = DMA1_Stream7;
    hdma_tx.Init.Channel             = DMA_CHANNEL_1;
    hdma_rx.Instance                 = DMA1_Stream2;
    hdma_rx.Init.Channel             = DMA_CHANNEL_1;
  }
  else if(t_I2cHandle[i2c_module_lookup(obj)].Instance == I2C3) {
    hdma_tx.Instance                 = DMA1_Stream4;
    hdma_tx.Init.Channel             = DMA_CHANNEL_1;
    hdma_rx.Instance                 = DMA1_Stream1;
    hdma_rx.Init.Channel             = DMA_CHANNEL_1;
  }
  else {
    hdma_tx.Instance                 = DMA1_Stream7;
    hdma_tx.Init.Channel             = DMA_CHANNEL_1;
    hdma_rx.Instance                 = DMA1_Stream0;
    hdma_rx.Init.Channel             = DMA_CHANNEL_1;
  }
  
  /* Enable DMA1 clock */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* Configure the DMA handler for Transmission process */
  hdma_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
  hdma_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
  hdma_tx.Init.MemInc              = DMA_MINC_ENABLE;
  hdma_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
  hdma_tx.Init.Mode                = DMA_NORMAL;
  hdma_tx.Init.Priority            = DMA_PRIORITY_LOW;
  hdma_tx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;         
  hdma_tx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
  hdma_tx.Init.MemBurst            = DMA_MBURST_INC4;
  hdma_tx.Init.PeriphBurst         = DMA_PBURST_INC4;
  
  HAL_DMA_Init(&hdma_tx);   
  
  /* Associate the initialized DMA handle to the the I2C handle */
  __HAL_LINKDMA(&t_I2cHandle[i2c_module_lookup(obj)], hdmatx, hdma_tx);
    
  /* Configure the DMA handler for Transmission process */
  hdma_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
  hdma_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
  hdma_rx.Init.MemInc              = DMA_MINC_ENABLE;
  hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
  hdma_rx.Init.Mode                = DMA_NORMAL;
  hdma_rx.Init.Priority            = DMA_PRIORITY_HIGH;
  hdma_rx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;         
  hdma_rx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
  hdma_rx.Init.MemBurst            = DMA_MBURST_INC4;
  hdma_rx.Init.PeriphBurst         = DMA_PBURST_INC4; 

  HAL_DMA_Init(&hdma_rx);
    
  /* Associate the initialized DMA handle to the the I2C handle */
  __HAL_LINKDMA(&t_I2cHandle[i2c_module_lookup(obj)], hdmarx, hdma_rx);
#endif

}

inline int i2c_start(i2c_t *obj)
{

#if !DEVICE_I2C_ASYNCH
    I2C_TypeDef *i2c = (I2C_TypeDef *)(obj->i2c);
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c);
#else
    I2C_TypeDef *i2c = (I2C_TypeDef *)(obj->i2c.i2c);
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c.i2c);
#endif
    int timeout;

    // Clear Acknowledge failure flag
    __HAL_I2C_CLEAR_FLAG(&t_I2cHandle[i2c_module_lookup(obj)], I2C_FLAG_AF);

    // Generate the START condition and remove an eventual pending STOP bit
    i2c->CR1 = ((i2c->CR1 & ~I2C_CR1_STOP) | I2C_CR1_START);

    // Wait the START condition has been correctly sent
    timeout = FLAG_TIMEOUT;
    while (__HAL_I2C_GET_FLAG(&t_I2cHandle[i2c_module_lookup(obj)], I2C_FLAG_SB) == RESET) {
        if ((timeout--) == 0) {
            return 1;
        }
    }

    return 0;
}

inline int i2c_stop(i2c_t *obj)
{
#if !DEVICE_I2C_ASYNCH
    I2C_TypeDef *i2c = (I2C_TypeDef *)(obj->i2c);
#else
    I2C_TypeDef *i2c = (I2C_TypeDef *)(obj->i2c.i2c);
#endif  

    // Generate the STOP condition
    i2c->CR1 |= I2C_CR1_STOP;

    return 0;
}

int i2c_read(i2c_t *obj, int address, char *data, int length, int stop)
{
#if !DEVICE_I2C_ASYNCH
    I2C_TypeDef *i2c = (I2C_TypeDef *)(obj->i2c);
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c);
#else
    I2C_TypeDef *i2c = (I2C_TypeDef *)(obj->i2c.i2c);
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c.i2c);
#endif
    int timeout;
    int count;
    int value;

    i2c_start(obj);

    // Wait until SB flag is set
    timeout = FLAG_TIMEOUT;
    while (__HAL_I2C_GET_FLAG(&t_I2cHandle[i2c_module_lookup(obj)], I2C_FLAG_SB) == RESET) {
        timeout--;
        if (timeout == 0) {
            return -1;
        }
    }

    i2c->DR = __HAL_I2C_7BIT_ADD_READ(address);


    // Wait address is acknowledged
    timeout = FLAG_TIMEOUT;
    while (__HAL_I2C_GET_FLAG(&t_I2cHandle[i2c_module_lookup(obj)], I2C_FLAG_ADDR) == RESET) {
        timeout--;
        if (timeout == 0) {
            return -1;
        }
    }
    __HAL_I2C_CLEAR_ADDRFLAG(&t_I2cHandle[i2c_module_lookup(obj)]);

    // Read all bytes except last one
    for (count = 0; count < (length - 1); count++) {
        value = i2c_byte_read(obj, 0);
        data[count] = (char)value;
    }

    // If not repeated start, send stop.
    // Warning: must be done BEFORE the data is read.
    if (stop) {
        i2c_stop(obj);
    }

