ARMmbed/mbed-hal-st-stm32f4/source/i2c_api.c
void i2c_transfer_asynch(i2c_t *obj, void *tx, size_t tx_length, void *rx, size_t rx_length, uint32_t address, uint32_t stop, uint32_t handler, uint32_t event, DMAUsage hint){

    // TODO: DMA usage is currently ignored by this way
    (void) hint;  
     
    // check which use-case we have  
    int use_tx = (tx != NULL && tx_length > 0);  
    int use_rx = (rx != NULL && rx_length > 0); 
  
  	obj->tx_buff.buffer = tx;
    obj->tx_buff.length = tx_length;

    obj->tx_buff.pos = 0;  
    obj->tx_buff.width = 8;  
  
    obj->rx_buff.buffer = rx;  
    obj->rx_buff.length = rx_length;  
    obj->rx_buff.pos = 0;  
    obj->rx_buff.width = 8;  

    g_handler[i2c_module_lookup(obj)] = handler;  
    g_event[i2c_module_lookup(obj)] = event; 
    g_stop_previous[i2c_module_lookup(obj)] = g_stop[i2c_module_lookup(obj)];
    g_stop[i2c_module_lookup(obj)] = stop; 
  
    // register the same thunking handler for both event and error interrupt!  
    IRQn_Type event_irq_n = I2cEventIRQs[i2c_module_lookup(obj)];  
    IRQn_Type error_irq_n = I2cErrorIRQs[i2c_module_lookup(obj)]; 
    if(((tx_length > 1)&&(rx_length == 0)) || ((rx_length > 1)&&(tx_length == 0)) || ((rx_length > 1)&&(tx_length > 1))){
			NVIC_SetVector(event_irq_n, (uint32_t)i2c1_irq_handler); 
		} else {
			NVIC_SetVector(event_irq_n, handler); 
		}
		
    HAL_NVIC_SetPriority(event_irq_n, 0, 1);      
    HAL_NVIC_EnableIRQ(event_irq_n);
    NVIC_SetVector(error_irq_n, handler); 
    HAL_NVIC_SetPriority(error_irq_n, 0, 0);      
    HAL_NVIC_EnableIRQ(error_irq_n);
    
    I2C_HandleTypeDef *handle = &t_I2cHandle[i2c_module_lookup(obj)];
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c.i2c);

    if (use_tx && use_rx) {
        g_receiveIT[i2c_module_lookup(obj)]=1;     
        if (tx_length == 1) {  
            HAL_I2C_Mem_Read_IT(handle, address, ((uint8_t*)tx)[0], I2C_MEMADD_SIZE_8BIT, rx, rx_length, g_stop_previous[i2c_module_lookup(obj)]);  
        } else if (tx_length == 2) {  
            uint16_t memoryAddress = (((uint8_t*)tx)[0] << 8) | ((uint8_t*)tx)[1];  
            HAL_I2C_Mem_Read_IT(handle, address, memoryAddress, I2C_MEMADD_SIZE_16BIT, rx, rx_length, g_stop_previous[i2c_module_lookup(obj)]);  
        }  
    } else if (use_tx) {
        g_transmitIT[i2c_module_lookup(obj)]=1;
        HAL_I2C_Master_Transmit_IT(handle, address, (uint8_t*)tx, tx_length, g_stop_previous[i2c_module_lookup(obj)]);
    } else if (use_rx) {  
        g_receiveIT[i2c_module_lookup(obj)]=1;
        HAL_I2C_Master_Receive_IT(handle, address, (uint8_t*)rx, rx_length, g_stop_previous[i2c_module_lookup(obj)]);  
    } else {
        g_errorIT[i2c_module_lookup(obj)]=1;
        HAL_I2C_Master_Check_IT(handle, address, g_stop_previous[i2c_module_lookup(obj)]);  
    }  

}

uint32_t i2c_irq_handler_asynch(i2c_t *obj){
  int event = 0;
  I2C_HandleTypeDef *handle = &t_I2cHandle[i2c_module_lookup(obj)];
	
  if(g_receiveIT[i2c_module_lookup(obj)]) {
    g_receiveIT[i2c_module_lookup(obj)]=0;
    HAL_I2C_EV_IRQHandler(handle);
  }
  if(g_transmitIT[i2c_module_lookup(obj)]) {
    g_transmitIT[i2c_module_lookup(obj)]=0;
    HAL_I2C_EV_IRQHandler(handle);
  }
  
  if(g_errorIT[i2c_module_lookup(obj)]) {
    g_errorIT[i2c_module_lookup(obj)]=0;
    __HAL_I2C_DISABLE_IT(&t_I2cHandle[i2c_module_lookup(obj)], I2C_IT_EVT);
    __HAL_I2C_DISABLE_IT(&t_I2cHandle[i2c_module_lookup(obj)], I2C_IT_ERR);
    
    if(__HAL_I2C_GET_FLAG(&t_I2cHandle[i2c_module_lookup(obj)], I2C_FLAG_AF)) {
      __HAL_I2C_CLEAR_FLAG(&t_I2cHandle[i2c_module_lookup(obj)], I2C_FLAG_AF);
      event |= I2C_EVENT_TRANSFER_EARLY_NACK;
    }
    else {
      __HAL_I2C_CLEAR_ADDRFLAG(&t_I2cHandle[i2c_module_lookup(obj)]);
      HAL_I2C_EV_IRQHandler(&t_I2cHandle[i2c_module_lookup(obj)]);
    }
    __HAL_UNLOCK(&t_I2cHandle[i2c_module_lookup(obj)]);
  }

  // If not repeated start, send stop.
	if (g_stop[i2c_module_lookup(obj)]) {
			i2c_stop(obj);
	}
	
	__HAL_I2C_DISABLE_IT(&t_I2cHandle[i2c_module_lookup(obj)], I2C_IT_EVT|I2C_IT_ERR|I2C_IT_BUF);
  t_I2cHandle[i2c_module_lookup(obj)].State=HAL_I2C_STATE_READY;	
  event |= I2C_EVENT_TRANSFER_COMPLETE;
  
  return (event & g_event[i2c_module_lookup(obj)]);
}

uint8_t i2c_active(i2c_t *obj){
    I2C_HandleTypeDef *handle = &t_I2cHandle[i2c_module_lookup(obj)];  
    HAL_I2C_StateTypeDef state = HAL_I2C_GetState(handle);  
  
    switch(state) {  
        case HAL_I2C_STATE_RESET:  
        case HAL_I2C_STATE_READY:  
        case HAL_I2C_STATE_ERROR:  
            return 0;  
        default:  
            return 1;  
     }  
}

void i2c_abort_asynch(i2c_t *obj){
    i2c_reset(obj);  
}

#endif // DEVICE_I2C_ASYNCH_DMA
#endif // DEVICE_I2C_ASYNCH
#endif // DEVICE_I2C
